In [3]:
import numpy as np

import pandas as pd

In [4]:
# 创建最简单的Series
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# values属性
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
# index属性
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'c', 'b', 'a'])

obj2

d    4
c    7
b   -5
a    3
dtype: int64

In [8]:
# 通过索引的方式选取Series的值
obj2['a']

3

In [9]:
obj2['d'] = 6

obj2[['c', 'a', 'd']]

c    7
a    3
d    6
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
c    7
a    3
dtype: int64

In [11]:
obj2 * 2

d    12
c    14
b   -10
a     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
c    1096.633158
b       0.006738
a      20.085537
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# 将python字典转化为Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Utah': 5000}

obj3 = pd.Series(sdata)

obj3

Ohio     35000
Texas    71000
Utah      5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

In [17]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon        False
Texas          True
dtype: bool

In [19]:
obj4.isnull()

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

In [20]:
obj3

Ohio     35000
Texas    71000
Utah      5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon             NaN
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
obj4.name = 'population'

In [24]:
obj4.index.name = 'state'

In [25]:
obj4

state
California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
# 按照列顺序排列
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five', 'six'])
    
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt'] = 1188

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  1188
two    2001    Ohio  1.7  1188
three  2002    Ohio  3.6  1188
four   2001  Nevada  2.4  1188
five   2002  Nevada  2.9  1188
six    2003  Nevada  3.2  1188

In [35]:
frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['one', 'two', 'three'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [38]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  -1.2     True
two    2001    Ohio  1.7  -1.5     True
three  2002    Ohio  3.6  -1.7     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [39]:
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002:3.6}}

frame3 = pd.DataFrame(pop)

frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [42]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [43]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [46]:
frame3.index.name = 'year'

frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [47]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [48]:
frame2.values

array([[2000, 'Ohio', 1.5, -1.2],
       [2001, 'Ohio', 1.7, -1.5],
       [2002, 'Ohio', 3.6, -1.7],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [50]:
# 索引对象
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [51]:
index[1:]

Index(['b', 'c'], dtype='object')

In [52]:
index[:-1]

Index(['a', 'b'], dtype='object')

In [53]:
index[:]

Index(['a', 'b', 'c'], dtype='object')

In [54]:
index[-1:]

Index(['c'], dtype='object')

In [55]:
index[0:2]

Index(['a', 'b'], dtype='object')

In [56]:
index[0:3]

Index(['a', 'b', 'c'], dtype='object')

In [57]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [58]:
labels = pd.Index(np.arange(3))

labels

Int64Index([0, 1, 2], dtype='int64')

In [59]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [60]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [61]:
'Ohio' in frame3.columns

True

In [62]:
dup_labels = pd.Index(['foo', 'foo', 'too', 'too'])

dup_labels

Index(['foo', 'foo', 'too', 'too'], dtype='object')

In [65]:
dup_labels.unique()

Index(['foo', 'too'], dtype='object')

In [66]:
# 重新索引
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [67]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [68]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [69]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [70]:
# 丢弃指定轴上的项
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [72]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [73]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [77]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [80]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [83]:
# 索引、选取和过滤
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [85]:
# 痛哟切片或布尔型数组选取数据
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [86]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [89]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0

data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
# 用loc和iloc进行选取
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [94]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [96]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [97]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [103]:
# 整数索引
ser = pd.Series(np.arange(3.))

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [105]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [106]:
ser.iloc[:1]

0    0.0
dtype: float64

In [107]:
ser[:1]

0    0.0
dtype: float64

In [108]:
# 算术运算和数据对齐
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
                                             
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [109]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [110]:
s1 +s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [111]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

df1

   A
0  1
1  2

In [112]:
df2

   B
0  3
1  4

In [113]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [116]:
# 在算术方法中填充值
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), columns=list('abcde'))

df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [117]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [118]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [119]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [120]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [122]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [123]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [124]:
# DataFrame和Series之间的运算
arr = np.arange(12.).reshape((3, 4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [125]:
arr[0]

array([0., 1., 2., 3.])

In [126]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [128]:
# 函数的应用和映射
frame = pd.DataFrame(np.random.randn(4, 3), index=['Utah', 'Ohix', 'Texas', 'Orefon'])

frame

               0         1         2
Utah   -0.269567 -1.596171  0.274454
Ohix    1.500345  2.917248 -1.745359
Texas   0.593047  0.818838  0.231779
Orefon -1.477074  1.780609 -0.443793

In [129]:
np.abs(frame)

               0         1         2
Utah    0.269567  1.596171  0.274454
Ohix    1.500345  2.917248  1.745359
Texas   0.593047  0.818838  0.231779
Orefon  1.477074  1.780609  0.443793

In [130]:
f = lambda x: x.max() - x.min()

In [131]:
frame.apply(f)

0    2.977418
1    4.513419
2    2.019813
dtype: float64

In [132]:
frame.apply(f, axis='columns')

Utah      1.870625
Ohix      4.662607
Texas     0.587059
Orefon    3.257682
dtype: float64

In [133]:
format = lambda x: '%.2f' % x

In [134]:
frame.applymap(format)

            0      1      2
Utah    -0.27  -1.60   0.27
Ohix     1.50   2.92  -1.75
Texas    0.59   0.82   0.23
Orefon  -1.48   1.78  -0.44

In [137]:
frame.loc[:,2].map(format)

Utah       0.27
Ohix      -1.75
Texas      0.23
Orefon    -0.44
Name: 2, dtype: object

In [143]:
# 排序和排名
obj = pd.Series(range(4), index=['d', 'a', 'c', 'b'])

obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [144]:
obj.sort_index(ascending=False)

d    0
c    2
b    3
a    1
dtype: int64

In [145]:
obj.sort_values()

d    0
a    1
c    2
b    3
dtype: int64

In [147]:
obj.sort_values(ascending=False)

b    3
c    2
a    1
d    0
dtype: int64

In [148]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [149]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [150]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [152]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [153]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [154]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [155]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [156]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [157]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [159]:
# 汇总和计算描述统计
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [160]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [161]:
df.idxmax()

one    b
two    d
dtype: object

In [162]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [163]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [164]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [170]:
# 相关系数与协方差
import pandas_datareader.data as web

all_data = {}

for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

all_data

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2004-08-19,51.693783,47.669952,49.676899,49.845802,44994500,49.845802
2004-08-20,54.187561,49.925285,50.178635,53.805050,23005800,53.805050
2004-08-23,56.373344,54.172661,55.017166,54.346527,18393200,54.346527
2004-08-24,55.439419,51.450363,55.260582,52.096165,15361800,52.096165
2004-08-25,53.651051,51.604362,52.140873,52.657513,9257400,52.657513
2004-08-26,53.626213,51.991844,52.135906,53.606342,7148200,53.606342
2004-08-27,53.959049,52.503513,53.700729,52.732029,6258300,52.732029
2004-08-30,52.404160,50.675404,52.299839,50.675404,5235700,50.675404
2004-08-31,51.519913,50.749920,50.819469,50.854240,4954800,50.854240
2004-09-01,51.152302,49.512966,51.018177,49.801090,9206800,49.801090
2004-09-02,50.854240,49.150326,49.274517,50.427021,15232100,50.427021
2004-09-03,50.541279,49.339096,50.148830,49.681866,5191000,49.681866
2004-09-07,50.670437,49.483158,50.178635,50.461796,5891300,50.461796
2004-09-08,51.182110,49.925285,50.044510,50.819469,5023000,50.819469
2004-09-09,51.023144,50.173668,50.933723,50.824436,4092100,50.824436
2004-09-10,52.935703,50.322701,50.471729,52.324677,8764200,52.324677
2004-09-13,53.854729,52.886028,52.970478,53.402668,7902900,53.402668
2004-09-14,55.638126,53.049961,53.377831,55.384777,10910200,55.384777
2004-09-15,56.745922,54.743942,54.922779,55.638126,10793500,55.638126
2004-09-16,57.525848,55.464260,55.807030,56.616764,9335800,56.616764
2004-09-17,58.365391,56.408119,56.840309,58.365391,9543500,58.365391
2004-09-20,60.407108,58.007717,58.097134,59.294346,10708500,59.294346
2004-09-21,59.820923,58.375324,59.517895,58.539257,7282900,58.539257
2004-09-22,59.448345,58.027588,58.320679,58.807514,7638000,58.807514
2004-09-23,60.918781,58.131908,59.036026,60.019630,8599600,60.019630
2004-09-24,61.649033,59.493053,60.079243,59.527828,9191900,59.527828
2004-09-27,60.049435,58.519386,59.393700,58.747902,7119100,58.747902
2004-09-28,63.288372,59.716602,60.258080,63.020115,17056100,63.020115
2004-09-29,67.073753,62.707150,62.940632,65.116478,30745600,65.116478
2004-09-30,65.722542,64.083199,64.530296,64.381264,13861300,64.381264
...,...,...,...,...,...,...
2009-11-18,287.519958,284.186646,286.461853,286.461853,3119200,286.461853
2009-11-19,285.145416,283.158325,285.031158,284.643677,4364100,284.643677
2009-11-20,283.953156,282.860260,282.909943,283.138458,4038500,283.138458
2009-11-23,291.404694,286.069397,286.382355,289.293427,5128000,289.293427
2009-11-24,290.257172,286.407196,289.377869,289.661041,3231200,289.661041
2009-11-25,291.633209,289.462341,291.310303,290.977478,2941400,290.977478
2009-11-27,289.348083,283.640198,284.151855,288.006805,2787100,288.006805
2009-11-30,289.949158,286.690369,288.438995,289.616333,3472500,289.616333
2009-12-01,293.699768,289.616333,292.164764,293.029114,4670700,293.029114
2009-12-02,294.588989,291.215912,293.590485,291.856750,3348000,291.856750
2009-12-03,293.814026,290.609863,292.616821,290.977478,2875900,290.977478
2009-12-04,295.493103,287.718658,294.593964,290.614838,5059900,290.614838
2009-12-07,292.442932,288.622772,290.217407,291.230835,3293500,291.230835
2009-12-08,293.421570,289.119568,289.864716,291.628235,3067700,291.628235
2009-12-09,292.760864,289.904449,291.851776,292.606873,3585000,292.606873
2009-12-10,295.433502,293.297394,293.312286,293.838867,3358200,293.838867
2009-12-11,295.453369,291.966034,295.418579,293.347046,3462300,293.347046
2009-12-14,296.725098,294.390289,295.751434,295.940186,3851600,295.940186
2009-12-15,296.263092,293.585510,294.733032,294.653564,4590400,294.653564
2009-12-16,298.245209,296.392242,297.365936,296.948639,5655300,296.948639
2009-12-17,296.889038,294.961548,296.292908,295.050964,5311800,295.050964
2009-12-18,297.529846,295.577545,296.089233,296.282959,7108900,296.282959
2009-12-21,297.981903,295.910400,296.874115,297.405670,5175800,297.405670
2009-12-22,298.806549,297.490112,298.727081,298.617767,3786000,298.617767
2009-12-23,304.454803,299.477203,299.800079,303.863647,4172200,303.863647
2009-12-24,307.758331,304.156738,304.484619,307.241699,1728500,307.241699
2009-12-28,310.972412,307.241699,308.821411,309.422516,3417800,309.422516
2009-12-29,310.401154,307.147308,310.351471,307.698730,2868100,307.698730
2009-12-30,309.352966,307.008209,307.251617,309.352966,2950200,309.352966
2009-12-31,310.679321,307.986847,310.356445,307.986847,2455400,307.986847

In [176]:
# 唯一值、值计数以及成员资格
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b'])

uniques = obj.unique()

uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [174]:
price = pd.DataFrame({tic: data['Adj Close']
                         for tic, data in all_data.iteritems()})
volume = pd.DataFrame({tic: data['Volume']
                         for tic, data in all_data.iteritems()})

KeyError: 'Adj Close'

In [178]:
uniques.sort()

In [190]:
# 读写文本格式的数据
parsed = pd.read_csv('example.txt', index_[])

parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16